%用来求不同情况下的cdf对比图
a1=[0.6991
0.5747
0.6246
0.0684
0.9732
0.3682
0.5622
0.4189
0.1575
0.1468
0.4671
1.0204
0.7573
0.4166
0.9331
0.2536
0.8272
0.4639
0.7607
0.6377
0.6252
0.8213
0.3675
0.7516
0.6658
0.1223
0.2977
0.3103
1.0073
0.4529
0.5849
1.0783
0.4155
0.4906
0.2275
1.0655
1.5056
1.1969
0.32
0.6371
0.4748
1.0483
0.2908
0.2983
0.2401
0.5449
0.26
0.2218
0.6052
0.1472
];
[b1 x1]=hist(a1,100);%分区间统计，这里分100个区间，可根据你的数据适当调整
num1=numel(a1);%num是数据的总个数
c1=cumsum(b1/num1);%计算累计分布
plot(x1,c1,'black-','LineWidth',2);%画图
hold on;




a2=[0.1031
0.2739
0.2216
0.3211
0.4232
1.0426
0.5987
0.6669
1.1714
1.1561
0.3996
0.7025
0.3639
0.46
0.4813
0.5101
0.0775
0.7641
0.9656
0.1748
2.6048
0.4795
0.3502
0.7133
0.1909
0.5562
0.6083
0.5395
0.3072
0.1652
0.8419
0.8716
0.246
0.9394
0.6802
0.513
0.9371
0.1504
2.4029
0.3959
1.4352
1.0611
0.2127
0.604
0.6708
0.3395
0.6782
0.2475
0.4074
1.2892
];
[b2 x2]=hist(a2,100);%分区间统计，这里分100个区间，可根据你的数据适当调整
num2=numel(a2);%num是数据的总个数
c2=cumsum(b2/num2);%计算累计分布
%plot(x2,c2,'blue-','LineWidth',2);%画图

a3=[
];
[b3 x3]=hist(a3,100);%分区间统计，这里分100个区间，可根据你的数据适当调整
num3=numel(a3);%num是数据的总个数
c3=cumsum(b3/num3);%计算累计分布
%plot(x3,c3,'green-','LineWidth',2);%画图



xlabel('定位误差（m）');
ylabel('累积分布函数');
title('定位误差累计分布图');
ylim([0 1])
%kk=legend('3节点','8节点','12节点','location','SouthEast');
%set(kk,'Fontsize',8);
grid on;